In [1]:
#pip install pandas xlrd

Requirement already satisfied: pandas in c:\users\anano\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: xlrd in c:\users\anano\anaconda3\lib\site-packages (2.0.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\anano\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\anano\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\anano\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\anano\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\anano\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
# configuration: show all columns
import pandas as pd
pd.set_option('display.max_columns', None)

In [2]:
# read the xls 
df_sharkattack= pd.read_excel('https://www.sharkattackfile.net/spreadsheets/GSAF5.xls')
df_sharkattack.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Unnamed: 11,Time,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,15 Mar 2024,2024.0,Unprovoked,AUSTRALIA,Queensland,Bargara Beach,Swimming,Brooklyn Sauer,F,13,"Minor injuries to back, abdomen and legs",NaN,16h00,Tiger shark,"Yahoo News, 3/15/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,04 Mar 2024,2024.0,Unprovoked,USA,Hawaii,"Old Man's, Waikiki",Surfing,Matthew White,M,NaN,"No injury, shark bit surfboard",N,NaN,Tiger shark 8',"Surfer, 3/6/2024F",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,02 Mar-2024,2024.0,Unprovoked,USA,Hawaii,"Rainbows, Oahu",Swimming,NaN,F,11,Lacerations to left foot,N,13h30,3' to 4' shark,"Hawaii News Now, 3/4/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,25 Feb-2024,2024.0,Unprovoked,AUSTRALIA,Western Australia,"Sandlnd Island, Jurian Bay",NaN,female,F,46,Leg bitten,N,11h30,Tiger shark,"WA Today, 2/26/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,14 Feb-2024,2024.0,Unprovoked,INDIA,Maharashtra,"Vaitarna River, Palghar District",Fishing,Vicky Suresh Govari,M,32,Calf of lower left leg injured,N,NaN,"Bull shark, 7'","Times of India, 2/14/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Start of the cleaning process:
We remove the rows (variables) and columns (data according to date) that we will not need for the analysis of our project.
As this is a project to sell anti-shark attack bracelets, we do not consider it necessary to have data from past centuries, 
We need to have a trend of the data to be able to analyze it, for this reason and for having a considerable amount of data.
We have decided to keep the data from the 60's onwards, we could keep the data from 1900, but they do not provide a 
great value to the analysis and furthermore, they are quite incomplete.

In [3]:
#look at the number of total rows and columns

df_sharkattack.shape #the result is 6969, 23 being 0 the index there would be 6968 rows and 22 columns
# I check what data is in the last row since it does not appear in the excel

(6969, 23)

In [4]:
df_sharkattack.tail(1) #this makes me verify that there are completely null rows and that is why they do not appear in the excel and in turn
                        # we are aware that if it were not checked we would still have null values ​​that do not provide any value in the data frame

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Unnamed: 11,Time,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
6968,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
# Create a list of indexes from row 4402 to the total number of rows (including that row)
delete_rows = list(range(4402, 6969))

In [ ]:
# rename and replace the columns into correct names
df_sharkattack.columns = df_sharkattack.columns.str.lower().str.replace(" ","_").str.replace(".","_").str.replace(":","").str.strip()
df_sharkattack = df_sharkattack.rename(columns={"species_" : "species"})

In [6]:
#use the drop function to be able to remove the rows that we do not need through the previous variable
df_sharkattack = df_sharkattack.drop(delete_rows)

In [7]:
# check that the number of rows has changed to 4402 (keep in mind that the index starts with 0)
df_sharkattack.shape # it is ok

(4402, 23)

Next, we will remove the columns that are not necessary for our analysis:

First, let's check and remove the columns that are made up of null values ​​in the vast majority.
Secondly, we are going to remove the columns from the variables type, name, injury, time, source that we do not need for our analysis as we have data that we do not see that influences sales

In [8]:
#df_sharkattack.info()

full_null_columns = df_sharkattack.columns[df_sharkattack.isnull().all()]

# with it we see that there is only one column without any data unnamed 22 which is in row 22
full_null_columns 

# Count the number of null values in each column
df_sharkattack.isna().sum()

Date                 0
Year                 1
Type                14
Country             11
State              209
Location           250
Activity           282
Name                96
Sex                299
Age               1262
Injury              18
Unnamed: 11        327
Time              1607
Species           1598
Source              14
pdf                142
href formula       147
href               145
Case Number        143
Case Number.1      144
original order     142
Unnamed: 21       4401
Unnamed: 22       4402
dtype: int64

Columns: unnamed_21 and unnamed_22 have all or almost all null values ​​4402

Columns: pdf, href_formula, href, case_number, case_number_1, original_order no they have so many null values ​​but we are not going to need them for our analysis so we are going to eliminate them too

In [9]:

df_sharkattack.info(24)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4402 entries, 0 to 4401
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            4402 non-null   object
 1   year            4401 non-null   float64
 2   type            4388 non-null   object
 3   country         4391 non-null   object
 4   state           4193 non-null   object
 5   location        4152 non-null   object
 6   activity        4120 non-null   object
 7   name            4306 non-null   object
 8   sex             4103 non-null   object
 9   age             3140 non-null   object
 10  injury          4384 non-null   object
 11  unnamed_11      4075 non-null   object
 12  time            2795 non-null   object
 13  species         2804 non-null   object
 14  source          4388 non-null   object
 15  pdf             4260 non-null   object
 16  href_formula    4255 non-null   object
 17  href            4257 non-null   object
 18  case_number     4259 non-null   object
 19  case_number_1   4258 non-null   object
 20  original_order  4260 non-null   float64
 21  unnamed_21      1 non-null      object
 22  unnamed_22      0 non-null      object
dtypes: float64(2), object(21)
memory usage: 791.1+ KB

In [10]:
df_sharkattack.columns

Index(['date', 'year', 'type', 'country', 'state', 'location', 'activity',
       'name', 'sex', 'age', 'injury', 'unnamed_11', 'time', 'species',
       'source', 'pdf', 'href_formula', 'href', 'case_number', 'case_number_1',
       'original_order', 'unnamed_21', 'unnamed_22'],
      dtype='object')

In [11]:
# save the columns to remove into list
columns_failed = ['date','type','name','injury','time','species','source','pdf', 'href_formula', 'href', 'case_number', 'case_number_1', 'original_order','unnamed_21','unnamed_22']

In [12]:
# next remove it
df_sharkattack = df_sharkattack.drop(columns = columns_failed)

In [13]:
# check all
df_sharkattack.info()
# column unnamed_11 it is not representative

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4402 entries, 0 to 4401
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        4401 non-null   float64
 1   country     4391 non-null   object
 2   state       4193 non-null   object
 3   location    4152 non-null   object
 4   activity    4120 non-null   object
 5   sex         4103 non-null   object
 6   age         3140 non-null   object
 7   unnamed_11  4075 non-null   object
dtypes: float64(1), object(7)
memory usage: 275.3+ KB

In [14]:
# change column name: unnamed_11 to representative name

df_sharkattack = df_sharkattack.rename(columns={"unnamed_11" : "death"})

In [15]:
# show results
df_sharkattack

,year,country,state,location,activity,sex,age,death
0,2024.0,AUSTRALIA,Queensland,Bargara Beach,Swimming,F,13,NaN
1,2024.0,USA,Hawaii,"Old Man's, Waikiki",Surfing,M,NaN,N
2,2024.0,USA,Hawaii,"Rainbows, Oahu",Swimming,F,11,N
3,2024.0,AUSTRALIA,Western Australia,"Sandlnd Island, Jurian Bay",NaN,F,46,N
4,2024.0,INDIA,Maharashtra,"Vaitarna River, Palghar District",Fishing,M,32,N
...,...,...,...,...,...,...,...,...
4397,1963.0,SOUTH AFRICA,KwaZulu-Natal,"Peace Cottage, Umdhloti","Free diving, hunting crayfish",M,27,N
4398,1963.0,SOUTH AFRICA,KwaZulu-Natal,"Selection Reef, Umdhloti",Spearfishing,M,24,N
4399,1963.0,AUSTRALIA,South Australia,Off Franklin Island between Streaky Bay & Ceduna,Shark fishing,NaN,NaN,N
4400,1963.0,MOZAMBIQUE,NaN,"Limpopo River, 547 km from the sea",NaN,NaN,NaN,N
4401,1963.0,FIJI,Vita Levu,Korolevu (South coast between Nadi & Suva),NaN,NaN,NaN,UNKNOWN